In [3]:
import numpy as np
import pandas as pd

In [4]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
        index=['Ohio', 'Colorado', 'New York'],
        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [5]:
transform=lambda x: x[:4].upper()
transform

In [6]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [7]:
data.rename(index=str.title,columns=str.title)

      One  Two  Three  Four
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [8]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'},inplace=True)
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [9]:
ages=np.random.randint(20,40,10)
ages

array([25, 23, 34, 32, 31, 23, 37, 33, 30, 34])

In [10]:
bins=[15,25,35,60,100]
cats=pd.cut(ages,bins)
cats

[(15, 25], (15, 25], (25, 35], (25, 35], (25, 35], (15, 25], (35, 60], (25, 35], (25, 35], (25, 35]]
Categories (4, interval[int64]): [(15, 25] < (25, 35] < (35, 60] < (60, 100]]

In [11]:
cats.codes

array([0, 0, 1, 1, 1, 0, 2, 1, 1, 1], dtype=int8)

In [26]:
a=[]
for i in range(10):
    temp=["(",np.random.randint(1,30),np.random.randint(1,30),"]"]
    a.append(temp)
a

[['(', 20, 28, ']'],
 ['(', 2, 10, ']'],
 ['(', 3, 9, ']'],
 ['(', 16, 20, ']'],
 ['(', 11, 15, ']'],
 ['(', 25, 16, ']'],
 ['(', 28, 19, ']'],
 ['(', 16, 11, ']'],
 ['(', 28, 7, ']'],
 ['(', 19, 17, ']']]

In [28]:
# lst=[]
# for i in a:
#     lst.append(i.split("'"))